"""
АЛГОРИТМ БЫСТРОГО ВОЗВЕДЕНИЯ В СТЕПЕНЬ 
(БИНАРНЫЙ, "СПРАВА НАЛЕВО")

////////////////////////////////////////////////////////////////////
(ДОБАВИТЬ ВОЗВЕДЕНИЕ В СТЕПЕНЬ ПО МОДУЛЮ НЕПРИВОДИМОГО МНОГОЧЛЕНА)
Многочлен представлять в виде массива по возрастанию степени
здесь также будет использоваться алгоритм Евклида
Файлы в telegram по тегу 'Баттлер' (неприводимость, критерий и т.д)
Example:
    x^p (mod f), где x - многочлен

1.КРИТЕРИЙ БАТТЛЕРА.

    В линейном регистре сдвига многочлен неприводим (кратных множителей нет) =>
    НОД  = 1
    (НОД'ов бесконечно много) => пускай старший коэфф будет равен 1 - (в качестве ограничения)
    НОД умножаем на обратный чтобы получить 1 
    если нельзя поделить в лоб то используем fastpow 
    всего коэффициентов в Поле Галуа = n (совпадает со степенью многочлена)
    не брать многочлен, который является НУЛЕМ (будет генерировать только нули)
    если нод !=1 то многочлен имеет кратный делитель 
    проверяем (приводИм /не приводИм) (по модулю ранга матрицы (ОТКУДА ПОЯВИЛАСЬ МАТРИЦА?))
"""

def fastPow(base: int, exp: int, mod: int):
    result = 1
    current_exp = exp 
    current_base = base % mod

    if current_exp & 1: # если показатель степени нечетный
        result = current_base 
    
    current_exp >>= 1

    while current_exp > 0:
        current_base = (current_base * current_base) % mod
        
        if current_exp & 1:
            result = (current_base * result) % mod
                    
        current_exp >>= 1

    return result 
